# __Pandas: Unique, Apply & Datetime__

In [1]:
import pandas as pd
import numpy as np

### __Reading Data from CSV__

In [2]:
emp_data = pd.read_csv("data/Emp_data.csv")
emp_data.head(3)

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary,City
0,677509,Lois,36.36,60,13.68,168251,Denver
1,940761,Brenda,47.02,60,9.01,51063,Stonewall
2,428945,Joe,54.15,68,0.98,50155,Michigantown

In [3]:
ins_df = pd.read_csv("data/medical_insurance.csv")
ins_df.head(3)

   age  gender    bmi  children smoker     region     charges
0   19  female  27.90         0    yes  southwest  16884.9240
1   18    male  33.77         1     no  southeast   1725.5523
2   28    male  33.00         3     no  southeast   4449.4620

### __Unique__

In [4]:
ins_df.gender.unique()

array(['female', 'male'], dtype=object)

- __Unique Size__

In [5]:
ins_df.gender.unique().size

2

### __Value Count__

In [6]:
ins_df.gender.value_counts()

gender
male      676
female    662
Name: count, dtype: int64

In [7]:
emp_data['Weight in Kgs'].unique().size

36

### __Crosstab__

In [8]:
ins_df.head(1)

   age  gender   bmi  children smoker     region    charges
0   19  female  27.9         0    yes  southwest  16884.924

In [9]:
pd.crosstab(ins_df['gender'], ins_df['smoker'])

smoker   no  yes
gender
female  547  115
male    517  159

In [10]:
new_table = pd.crosstab(ins_df['region'], ins_df['smoker'])
new_table

smoker      no  yes
region
northeast  257   67
northwest  267   58
southeast  273   91
southwest  267   58

In [11]:
new_df = ins_df.head(15)
new_df

    age  gender     bmi  children smoker     region      charges
0    19  female  27.900         0    yes  southwest  16884.92400
1    18    male  33.770         1     no  southeast   1725.55230
2    28    male  33.000         3     no  southeast   4449.46200
3    33    male  22.705         0     no  northwest  21984.47061
4    32    male  28.880         0     no  northwest   3866.85520
5    31  female  25.740         0     no  southeast   3756.62160
6    46  female  33.440         1     no  southeast   8240.58960
7    37  female  27.740         3     no  northwest   7281.50560
8    37    male  29.830         2     no  northeast   6406.41070
9    60  female  25.840         0     no  northwest  28923.13692
10   25    male  26.220         0     no  northeast   2721.32080
11   62  female  26.290         0    yes  southeast  27808.72510
12   23    male  34.400         0     no  southwest   1826.84300
13   56  female  39.820         0     no  southeast  11090.71780
14   27    male  42.130         0    yes  southeast  39611.75770

In [12]:
new_df.to_csv('data/test.csv')

In [13]:
n_df = pd.read_csv('data/test.csv')
clean = new_df.drop(0)
clean

    age  gender     bmi  children smoker     region      charges
1    18    male  33.770         1     no  southeast   1725.55230
2    28    male  33.000         3     no  southeast   4449.46200
3    33    male  22.705         0     no  northwest  21984.47061
4    32    male  28.880         0     no  northwest   3866.85520
5    31  female  25.740         0     no  southeast   3756.62160
6    46  female  33.440         1     no  southeast   8240.58960
7    37  female  27.740         3     no  northwest   7281.50560
8    37    male  29.830         2     no  northeast   6406.41070
9    60  female  25.840         0     no  northwest  28923.13692
10   25    male  26.220         0     no  northeast   2721.32080
11   62  female  26.290         0    yes  southeast  27808.72510
12   23    male  34.400         0     no  southwest   1826.84300
13   56  female  39.820         0     no  southeast  11090.71780
14   27    male  42.130         0    yes  southeast  39611.75770

In [14]:
for x in clean.iloc[::2, 0]:
    clean.iloc[::2, 0] = np.nan
clean

     age  gender     bmi  children smoker     region      charges
1    NaN    male  33.770         1     no  southeast   1725.55230
2   28.0    male  33.000         3     no  southeast   4449.46200
3    NaN    male  22.705         0     no  northwest  21984.47061
4   32.0    male  28.880         0     no  northwest   3866.85520
5    NaN  female  25.740         0     no  southeast   3756.62160
6   46.0  female  33.440         1     no  southeast   8240.58960
7    NaN  female  27.740         3     no  northwest   7281.50560
8   37.0    male  29.830         2     no  northeast   6406.41070
9    NaN  female  25.840         0     no  northwest  28923.13692
10  25.0    male  26.220         0     no  northeast   2721.32080
11   NaN  female  26.290         0    yes  southeast  27808.72510
12  23.0    male  34.400         0     no  southwest   1826.84300
13   NaN  female  39.820         0     no  southeast  11090.71780
14  27.0    male  42.130         0    yes  southeast  39611.75770

In [15]:
clean.gender = clean['gender'].fillna('Female')

In [16]:
clean

     age  gender     bmi  children smoker     region      charges
1    NaN    male  33.770         1     no  southeast   1725.55230
2   28.0    male  33.000         3     no  southeast   4449.46200
3    NaN    male  22.705         0     no  northwest  21984.47061
4   32.0    male  28.880         0     no  northwest   3866.85520
5    NaN  female  25.740         0     no  southeast   3756.62160
6   46.0  female  33.440         1     no  southeast   8240.58960
7    NaN  female  27.740         3     no  northwest   7281.50560
8   37.0    male  29.830         2     no  northeast   6406.41070
9    NaN  female  25.840         0     no  northwest  28923.13692
10  25.0    male  26.220         0     no  northeast   2721.32080
11   NaN  female  26.290         0    yes  southeast  27808.72510
12  23.0    male  34.400         0     no  southwest   1826.84300
13   NaN  female  39.820         0     no  southeast  11090.71780
14  27.0    male  42.130         0    yes  southeast  39611.75770

In [17]:
clean.gender.apply(lambda x:x.capitalize())

1       Male
2       Male
3       Male
4       Male
5     Female
6     Female
7     Female
8       Male
9     Female
10      Male
11    Female
12      Male
13    Female
14      Male
Name: gender, dtype: object

In [18]:
np.vstack([1,2,3,4])

array([[1],
       [2],
       [3],
       [4]])

In [19]:
np.hstack([1,2,3,4])

array([1, 2, 3, 4])

In [20]:
for i,v in np.ndindex(2,6):
    print(i, v)

0 0
0 1
0 2
0 3
0 4
0 5
1 0
1 1
1 2
1 3
1 4
1 5